import { lib, game, ui, get, ai, _status } from "../../../../noname.js";

export const characterTranslate = {
	谋曹丕: "谋曹丕",
	爻袁术: "爻袁术",
	未遂: "未遂",
	谋曹丕_prefix: "谋",
	爻袁术_prefix: "爻",
};
export const characterTitle = {
	谋曹丕: "魏文帝",
	爻袁术: "仲帝",
	未遂: "异界的神使",
};
export const characterIntro = {
	谋曹丕: "魏文帝曹丕，曹操之子，魏国的开国皇帝。少时博学多闻，兼具文武之才，在乱世之中步步为营，最终继承父业、代汉称帝。心思深沉而善于权谋的他，向来不会将胜负交予天意——因为在他眼中，天下的一切，都应当掌握在自己手中。",
	爻袁术: "字公路，袁绍之弟，出身四世三公的汝南袁氏。凭借家世与权势割据淮南，却逐渐沉溺于权力与奢华，最终甚至冒号称帝，自立仲氏。手握玉玺、妄称天命的他曾幻想天下尽归己手，却终究众叛亲离、兵败身死，只留下那场短暂而荒诞的帝梦。",
	未遂: "子右：叽里咕噜地说什么呢凑未遂<br>名字寓意幸运与宿命一体两面，象征顺遂与苦难共生。她是穿梭在时序夹缝的战士，一名以守护为终身信念的捍卫者，也是人类最后的救世主。<br>世间存在一条早已被预判、难以挣脱的宿命洪流，仅凭一人之力很难扭转既定走向。为此她跨越世界前来，想要伸出援手。可身为来自时间支流的异乡人，世界规则重重束缚着她，不允许她大肆干涉世事，只能在夹缝之中悄然释放力量，默默为前路挣扎之人提供微弱支撑。她亲眼见证过世界走向终末，是绝不向悲剧结局妥协的不屈者。<br>身为半人半神，即便主动压制自身权能，依旧拥有抗衡强大存在的实力。她能够触及力量的上限，根源在于她承接了先行者遗留的意志与力量。<br>反抗宿命的根基，源于她刻在灵魂里的悲悯与捍卫之心。强大外壳之下，她本性温柔，始终不忍看见众生被命运裹挟、承受苦难。她执着坚定，曾一度对前路感到迷茫，当亲眼看见有人始终坚守初心、奋力对抗洪流，她选择再度托付信任，决心倾尽自身一切，站在对方身旁，一同捍卫那份不愿被碾碎的理想。"
};
