import { lib, game, ui, get, ai, _status } from "../../../../noname.js";

export const characterTranslate = {
	流萤: "流萤",
	大丽花: "大丽花",
	忘归人: "忘归人",
	灵砂: "灵砂",
	知更鸟: "知更鸟",
	云璃: "云璃",
	遐蝶: "遐蝶",
	死龙: "死龙",
	黄泉: "黄泉",
};
export const characterTitle = {
	流萤: "为生而战",
	大丽花: "枯萎凋零",
	忘归人: "重获新生",
	灵砂: "宿香暗贮",
	知更鸟: "群星闪耀",
	云璃: "猎剑士",
	遐蝶: "死荫的侍女",
	死龙: "终焉之骸",
	黄泉: "彼岸冥途",
};
export const characterIntro = {
	流萤: "星核猎手的成员之一，身着机械装甲「萨姆」战斗的少女。她原本是为对抗虫群而诞生的兵器，却因生命短暂而始终追寻着属于自己的“生”。即使命运早已写下结局，她依然选择向前，为了能够真正活着，再一次向命运发起挑战。",
	大丽花: "于记忆与烈火中起舞的神秘女子，曾是忆庭中的忆者，如今却选择背离过去。她能够将自己的记忆化作熊熊燃烧的火焰，在焚烧一切的同时也将自己曾经的过往彻底舍弃。危险、优雅而又疯狂，她仿佛一朵盛开在灰烬之中的花，以毁灭过去的方式寻找全新的自我。",
	忘归人:"历经劫难后重新归来的停云，以「忘归人」之名踏上新的旅途。她曾于死亡与混沌之中迷失自我，却最终抓住了属于“生”的希望，因此得以再次与昔日的恩公相遇。前尘旧梦已经随风而去，如今的她只愿带着新的身份继续向未来前行。",
	灵砂: "来自罗浮丹鼎司的医士，擅长医术与香道，并以独特的方式为病痛之人带来安宁。她性格温和从容，面对复杂的病症与纷乱的局势也总能保持冷静。对她而言，医者不仅要治愈身体，更要抚慰人心，因此她始终以自己的方式守护着身边之人的生机。",
	知更鸟: "出生于匹诺康尼的天环族歌者，以优美的歌声闻名银河。她曾在「谐乐大典」为万千来客献唱，能够借助「同谐」的力量让歌声跨越星海，使无数生命产生共鸣。温柔优雅的外表之下，她同样怀抱着让整个宇宙都能听见幸福歌声的愿望。",
	云璃: "来自仙舟「朱明」的少女剑士，也是技艺精湛的猎剑士。她性格直率爽朗，痴迷于研究天下名剑，并凭借卓越的剑术不断挑战强敌。对她而言，锻剑与练剑从来不只是技艺，更是一场不断超越自我、追寻最强之剑的漫长修行。",
	遐蝶: "冥河的女儿，翁法罗斯的黄金裔，也是寻索「死亡」火种之人。她背负着故乡与无数亡魂的哀愿，在生与死的边界上踏上漫长旅途。她与死亡相伴，却并不畏惧死亡，因为她始终相信，凋零并非终点——生命终会以另一种形式重新绽放。",
	死龙: "曾经游荡于冥河之中的「死亡」泰坦，如今以腐朽残躯重新苏醒。它曾逆着冥河潮汐而上，将死亡的终局带给翁法罗斯万物，令濒死者与亡者都为之战栗。如今，它回应遐蝶的召唤，与她一同踏上寻找死亡火种的旅途，既是毁灭的化身，也是守护她走向终点的亡魂巨龙。",
	黄泉: "自称「巡海游侠」的神秘旅人，身佩一柄长刀，独自穿行于浩瀚银河。她沉默寡言，来历成谜，仿佛始终在追寻某个已经无法回头的终点。每一次挥刀都伴随着死亡与终结，而在那双看似平静的眼眸深处，似乎还埋藏着一段不愿被世人知晓的过去。",
};
