import { lib, game, ui, get, ai, _status } from "../../../../../../noname.js";

export const characterTranslate = {
	安培拉星人: "安培拉星人",
	黑暗迪迦: "黑暗迪迦",
	黑暗迪迦_prefix: "黑暗",
};
export const characterTitle = {
	安培拉星人: "黑暗皇帝",
	黑暗迪迦: "暗之巨人",
};
export const characterIntro = {
	安培拉星人: "统治黑暗宇宙的皇帝，曾率领庞大的黑暗军势向光之国发动战争，是无数奥特战士心中的梦魇。他拥有凌驾于普通奥特战士之上的强大力量，并以征服与支配为目的。即使经历漫长岁月，他的身影依旧象征着宇宙中最深沉、最恐怖的黑暗。",
	黑暗迪迦: "曾经支配超古代文明的黑暗巨人，也是迪迦奥特曼最初的姿态。与三千万年前的同伴一同掌握着强大的黑暗力量，后来在幽怜的影响下放弃黑暗，将力量留给了后世的人类。即使如今化为光明，他曾经的身姿依然诉说着一段关于力量、选择与救赎的往事。",
};
