import { lib, game, ui, get, ai, _status } from "../../../../../../noname.js";

export const characterTranslate = {
	普利茨墨: "普利茨墨",
	加坦杰厄: "加坦杰厄",
};
export const characterTitle = {
	普利茨墨: "光怪兽",
	加坦杰厄: "黑暗支配者",
};
export const characterIntro = {
	普利茨墨: "光怪兽普利茨墨，诞生于南极冰盖之下，是一种以光为食的神秘怪兽。白天会隐藏身形吸收太阳光，夜晚则会主动寻找各种人造光源。其身体由结晶构成，拥有极其坚硬的防御力，能够将强烈的光线反射，并通过中央的光芒核心释放特殊光线，将接触到的物体逐渐转化为光的结晶并使其消失。普利茨墨曾让杰克奥特曼陷入苦战，甚至能够将其吸入体内。然而，这种以光为生的怪兽却有着与自身诞生环境相反的弱点——极低温会使其停止活动。最终，杰克利用体外的低温与体内的高热制造热膨胀，使普利茨墨彻底毁灭，并化作极光消散。",
	加坦杰厄: "超古代文明遗留下来的邪神，被称为“黑暗的支配者”。它盘踞于露露耶遗迹深处，以无尽的黑暗笼罩世界，拥有足以令大地沉入黑暗的恐怖力量。面对这样的绝望，即使是光之巨人也曾陷入苦战。",
};
