// 角色评级静态数据（仅保存与导出，注册逻辑见 src/systems/tierlist.js）
export const rankMap = {
	s: ["芙宁娜芙卡洛斯", "奥特之王", "遐蝶", "赛迦", "谋曹丕", "那维莱特", "阿蕾奇诺", "云璃", "闪耀迪迦", "玛薇卡", "安培拉星人", "流萤", "奥特之父", "丝柯克", "迪迦", "希卡利", "芙宁娜", "奥特曼", "恰斯卡", "希诺宁", "奈克瑟斯", "黑暗迪迦", "杰克", "普利茨墨", "曼波", "哈基米", "米浴", "特别周", "黄金船", "忘归人", "灵砂", "知更鸟", "目白麦昆", "大丽花", "加坦杰厄", "伊格尼兹", "戴拿", "佐菲", "泰罗", "爻袁术", "艾斯", "赛文", "至高盖亚", "雷欧", "杰斯提斯", "黄泉", "未遂", "爱迪", "阿斯特拉"],
	ap: [],
	a: [],
	am: [],
	b: [],
	c: [],
};

export const rarityMap = {
	legend: ["芙宁娜芙卡洛斯", "奥特之王", "遐蝶", "赛迦", "谋曹丕", "那维莱特", "阿蕾奇诺", "云璃", "闪耀迪迦", "玛薇卡", "安培拉星人", "流萤", "奥特之父", "丝柯克", "迪迦", "希卡利", "芙宁娜", "奥特曼", "恰斯卡", "希诺宁", "奈克瑟斯", "黑暗迪迦", "杰克", "普利茨墨", "曼波", "哈基米", "米浴", "特别周", "黄金船", "忘归人", "灵砂", "知更鸟", "目白麦昆", "大丽花", "加坦杰厄", "伊格尼兹", "戴拿", "佐菲", "泰罗", "爻袁术", "艾斯", "赛文", "至高盖亚", "雷欧", "杰斯提斯", "黄泉", "未遂", "爱迪", "阿斯特拉"],
	epic: [],
	rare: [],
	junk: [],
};
