import { lib, game, ui, get, ai, _status } from "../../../../noname.js";

export const characterTranslate = {
	曼波: "曼波",
	哈基米: "哈基米",
	米浴: "米浴",
	特别周: "特别周",
	黄金船: "黄金船",
	目白麦昆: "目白麦昆",
};
export const characterTitle = {
	曼波: "子右人间体",
	哈基米: "蜂蜜特饮",
	米浴: "向死而生",
	特别周: "乡下马",
	黄金船: "白色怪物",
	目白麦昆: "名门大小姐",
};
export const characterIntro = {
	曼波: "曼波，是子右的人间体。她天真活泼、乐观热情，总是带着灿烂的笑容面对一切。哪怕前方是无法预知的困难，她也会选择勇敢迈出脚步，因为她相信，奔跑本身就是向未来发起的挑战。",
	哈基米: "东海帝皇是一名活泼开朗、天真烂漫的赛马娘。她拥有极强的自信与胜负欲，一直以成为“无败三冠赛马娘”为目标，并憧憬着学生会会长鲁道夫象征。她看似总是精力充沛、喜欢炫耀自己的实力，实际上也有着不服输的坚强意志。即使遭遇伤病与挫折，她依然不愿放弃奔跑的梦想，一次次挑战自己的极限。对她而言，赛道不仅是证明实力的地方，更是追逐梦想、回应支持自己的人的地方。",
	米浴: "米浴是一名性格温柔而胆怯的赛马娘。因为过去的经历以及比赛结果，她总认为自己会给身边的人带来不幸，因此常常刻意与他人保持距离，并把失败和不幸归咎于自己。然而，看似弱小的她其实拥有无比坚强的内心。即使一次次被所谓的“厄运”与命运捉弄，她依旧愿意为了支持自己的人不断努力，希望有一天能够摆脱“带来不幸”的名声，将胜利与幸福带给大家。",
	黄金船: "性格奔放、自由随性的赛马娘，总是以常人难以预料的方式行动。她既喜欢恶作剧，也热衷于一切新奇有趣的事物，看似不着边际，却拥有顶尖的实力与顽强的胜负心。对她而言，奔跑与冒险本就是一场永远不会结束的乐趣。",
	特别周: "从北海道来到东京的少女赛马娘，性格坦率开朗，是个认真而努力的追梦者。为了完成与母亲的约定，她立志成为“日本第一的赛马娘”。即使在追逐梦想的道路上遭遇挫折，她也从不会轻易放弃，而是凭借自己的努力一次次向终点迈进。",
	目白麦昆: "出身名门目白家的优雅大小姐，以成为顶尖长距离赛马娘为目标。她举止端庄、性格沉稳，对自己的使命与实力有着强烈的自觉，并立志实现目白家称霸天皇赏的宿愿。看似完美无缺的她，却也有着无法抵抗甜点诱惑的可爱一面。",
};
